[
    {
      "bookId": 1,
      "bookName": "The Dating Play Book for Men",
      "author": "Andrew Ferebee",
      "image": "dating_playbook.jpg",
      "review": "In 'The Dating Playbook for Men', Andrew Ferebee provides a comprehensive guide for men looking to navigate the complexities of modern dating and relationships. Drawing from personal experience and expert insights, Ferebee offers practical advice and strategies for meeting women, building confidence, and fostering meaningful connections. From initiating conversations to planning memorable dates, this book covers everything a man needs to know to succeed in the dating world. Ferebee's engaging writing style and relatable anecdotes make this book an enjoyable and informative read for men of all ages.",
      "totalPages": 320,
      "rating": 4.6,
      "category": "Relationships",
      "tags": ["#Dating", "#Self-Help"],
      "publisher": "Knowledge for Men",
      "yearOfPublishing": 2015
    },
    {
      "bookId": 2,
      "bookName": "Why Do You Hate Money",
      "author": "Ramit Sethi",
      "image": "hate_money.jpg",
      "review": "In 'Why Do You Hate Money', Ramit Sethi delves into the psychology behind people's complex relationship with money. Through a series of thought-provoking insights and practical exercises, Sethi challenges readers to examine their beliefs and behaviors surrounding finances. From addressing common money myths to debunking harmful mindsets, this book offers a fresh perspective on achieving financial success and abundance. Sethi's witty and engaging writing style, combined with actionable advice, makes this book a must-read for anyone looking to transform their financial mindset and habits.",
      "totalPages": 272,
      "rating": 4.4,
      "category": "Personal Finance",
      "tags": ["#Money Management", "#Mindset"],
      "publisher": "I Will Teach You to Be Rich",
      "yearOfPublishing": 2021
    },
    {
      "bookId": 3,
      "bookName": "The Hate U Give",
      "author": "Angie Thomas",
      "image": "hate_u_give.jpg",
      "review": "Angie Thomas's 'The Hate U Give' is a powerful and timely novel that tackles themes of race, identity, and social justice. Through the eyes of protagonist Starr Carter, Thomas explores the complexities of growing up in a divided society and the impact of police brutality on marginalized communities. With its raw emotion and unflinching honesty, this book offers readers a glimpse into the realities of systemic racism and the importance of speaking out against injustice. 'The Hate U Give' is a thought-provoking and impactful read that will resonate with readers long after they've turned the final page.",
      "totalPages": 464,
      "rating": 4.8,
      "category": "Young Adult",
      "tags": ["#Social Issues", "#Coming of Age"],
      "publisher": "Balzer + Bray",
      "yearOfPublishing": 2017
    },
    {
      "bookId": 4,
      "bookName": "The Scholarship Monthly Planner",
      "author": "Kelly Tanabe",
      "image": "scholarship_planner.jpg",
      "review": "For students navigating the overwhelming process of scholarship applications, 'The Scholarship Monthly Planner' by Kelly Tanabe is an invaluable resource. This comprehensive planner provides a month-by-month guide to organizing and tracking scholarship opportunities, deadlines, and application materials. With helpful tips and strategies for maximizing scholarship potential, Tanabe empowers students to take control of their financial future. Whether you're a high school senior or a college student, this planner is an essential tool for securing scholarship funding and reducing the burden of student debt.",
      "totalPages": 144,
      "rating": 4.2,
      "category": "Education",
      "tags": ["#Scholarships", "#Planner"],
      "publisher": "SuperCollege",
      "yearOfPublishing": 2020
    },
    {
      "bookId": 5,
      "bookName": "Annotated Texas Family Code",
      "author": "Publisher's Editorial Staff",
      "image": "texas_family_code.jpg",
      "review": "The 'Annotated Texas Family Code' is an essential reference for legal professionals and individuals navigating family law in Texas. This comprehensive volume includes the full text of the Texas Family Code, along with annotations, case summaries, and cross-references to relevant statutes and court decisions. Whether you're a lawyer, judge, or concerned citizen, this annotated code provides invaluable insights and interpretations of Texas family law. With its clear organization and authoritative commentary, this book is an indispensable resource for anyone dealing with family legal matters in the Lone Star State.",
      "totalPages": 1200,
      "rating": 4.5,
      "category": "Law",
      "tags": ["#Legal", "#Texas"],
      "publisher": "Thomson Reuters",
      "yearOfPublishing": 2022
    },
    {
      "bookId": 6,
      "bookName": "Loving Jesus More",
      "author": "Philip Graham Ryken",
      "image": "loving_jesus.jpg",
      "review": "In 'Loving Jesus More', Philip Graham Ryken invites readers on a transformative journey of deepening their love and devotion to Jesus Christ. With warmth and insight, Ryken explores the central teachings of Christianity and offers practical guidance for growing in intimacy with Christ. From cultivating a vibrant prayer life to embracing the disciplines of discipleship, this book provides inspiration and encouragement for spiritual growth. Whether you're a new believer or a seasoned Christian, 'Loving Jesus More' will challenge and enrich your faith journey.",
      "totalPages": 208,
      "rating": 4.7,
      "category": "Religion",
      "tags": ["#Christianity", "#Devotional"],
      "publisher": "Crossway",
      "yearOfPublishing": 2002
    },
    {
      "bookId": 7,
      "bookName": "The Latest Art of Good Conversion",
      "author": "Jeremy Pierre",
      "image": "good_conversion.jpg",
      "review": "In 'The Latest Art of Good Conversion', Jeremy Pierre offers practical insights and strategies for effectively sharing the gospel and leading others to faith. Drawing from Scripture and psychological principles, Pierre provides a comprehensive framework for engaging in meaningful conversations about faith. Whether you're a pastor, counselor, or layperson, this book equips you with the tools and techniques needed to communicate the message of salvation with clarity and compassion. With its blend of theological depth and practical wisdom, 'The Latest Art of Good Conversion' is a valuable resource for anyone seeking to fulfill the Great Commission.",
      "totalPages": 192,
      "rating": 4.3,
      "category": "Religion",
      "tags": ["#Evangelism", "#Counseling"],
      "publisher": "Crossway",
      "yearOfPublishing": 2021
    },
    {
        "bookId": 8,
        "bookName": "Cold-Case Christianity",
        "author": "J. Warner Wallace",
        "image": "cold_case_christianity.jpg",
        "review": "J. Warner Wallace's 'Cold-Case Christianity' is a compelling examination of the evidence for Christianity using principles from cold-case detective work. Wallace, a former atheist and seasoned cold-case detective, applies his investigative skills to the claims of the New Testament, presenting a compelling case for the reliability of the Gospels and the truth of Christianity. Through logical arguments and real-life case studies, Wallace demonstrates the historical reliability of the Bible and the credibility of Jesus Christ as a historical figure. 'Cold-Case Christianity' is a thought-provoking and engaging read that will challenge skeptics and strengthen the faith of believers.",
        "totalPages": 288,
        "rating": 4.6,
        "category": "Religion",
        "tags": ["#Apologetics", "#Christianity"],
        "publisher": "David C. Cook",
        "yearOfPublishing": 2013
      },
      {
        "bookId": 9,
        "bookName": "Spine of The Dragon",
        "author": "Kevin J. Anderson",
        "image": "spine_dragon.jpg",
        "review": "Kevin J. Anderson's 'Spine of The Dragon' is an epic fantasy adventure set in a world of magic, politics, and ancient prophecies. In the land of Quandis, tensions simmer between the ruling Arakand Empire and the rebellious Marist Confederacy, threatening to plunge the realm into chaos. As dark forces awaken and ancient secrets are revealed, unlikely heroes must rise to confront the looming threat and restore balance to the world. With its rich world-building, complex characters, and thrilling plot twists, 'Spine of The Dragon' is a captivating read that will leave fantasy fans eagerly awaiting the next installment.",
        "totalPages": 560,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": ["#Epic Fantasy", "#Adventure"],
        "publisher": "Tor Books",
        "yearOfPublishing": 2019
      }      
]